app/views/tweets/_trends.html.erb

SELECT "tweets".* FROM "tweets" ORDER BY created_at DESC
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 3]]
---
					<p style="font-weight: bold; color: #209CEE"><i style="font-weight: bold;" class="fa fa-twitter"></i></p>
					<p><%= current_user.tweets.count %></p>