app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all.order("created_at DESC")
    @tweet = Tweet.new
    @users = User.all
---
SELECT  "tweets".* FROM "tweets" ORDER BY created_at ASC LIMIT ?  [["LIMIT", 1]]
SELECT "users"."id" FROM "users"

  def create
    @tweet = current_user.tweets.build(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("tweet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweet", "Tweet count"], ["created_at", "2019-09-28 19:59:32.909168"], ["updated_at", "2019-09-28 19:59:32.909168"], ["user_id", 3]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "tweet" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["tweet", "H3ll0 w0rld!"], ["updated_at", "2019-09-29 01:09:54.394979"], ["id", 14]]