app/views/profile/index.html.erb

SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 3]]
---
								<strong class="title is-5">E-mail:</strong><%= current_user.email %><br>
								<strong class="title is-5">Tweet: </strong><%= current_user.tweets.count%><br><br>